# Indexing Dataframes

In [1]:
#importing pandas library
import pandas as pd

In [2]:
#Creating Samole Dataframe
column1 = ['sai','ajay','ramu','somu']
column2 = [45,20,46,29]
column3 = ['A','D','A','B']

df = pd.DataFrame({'Names': column1,'Marks': column2,'Grade': column3})
df

  Names  Marks Grade
0   sai     45     A
1  ajay     20     D
2  ramu     46     A
3  somu     29     B

### Let's access rows from index 1 to index 3

In [3]:
df.iloc[1:4]

  Names  Marks Grade
1  ajay     20     D
2  ramu     46     A
3  somu     29     B

### Let's get single column 'Names' from Dataframe

In [4]:
df['Names']

0     sai
1    ajay
2    ramu
3    somu
Name: Names, dtype: object

### Let's access Multiple columns 'Names' and 'Marks' from Dataframe

In [6]:
df[['Names','Marks']]

  Names  Marks
0   sai     45
1  ajay     20
2  ramu     46
3  somu     29

### Let's get marks and grade scored by student 'Ramu'

In [8]:
# method 1
df.iloc[2][['Marks','Grade']]

Marks    46
Grade     A
Name: 2, dtype: object

In [12]:
# method 2
df[df['Names'] == 'ramu'][['Marks','Grade']]

   Marks Grade
2     46     A

## Inroduction to .loc for accessing Rows

Note:

.loc() is used while accessing labels and .iloc() used index position

In [13]:
# Let's change the row index to custom labels 
df.index = ['a','b','c','d']
df

  Names  Marks Grade
a   sai     45     A
b  ajay     20     D
c  ramu     46     A
d  somu     29     B

### Let's access the row having name 'Ramu'

In [14]:
#using label
df.loc['c']

Names    ramu
Marks      46
Grade       A
Name: c, dtype: object

In [16]:
#using index
df.iloc[2]

Names    ramu
Marks      46
Grade       A
Name: c, dtype: object

### Let's get marks and grade of student 'ajay'

In [17]:
#using label
df.loc['b'][['Marks','Grade']]

Marks    20
Grade     D
Name: b, dtype: object

In [18]:
#using index
df.iloc[1][['Marks','Grade']]

Marks    20
Grade     D
Name: b, dtype: object

# Pandas Concatenation

### Key point:
1.It will helps to concatenate two dataframes either vertically or horizontally.

In [19]:
#importing pandas library
import pandas as pd

In [21]:
#Let's create first dataframe
column1 = ['Rahul','Ajay','Kiran','Mohan']
df1 = pd.DataFrame({'Names': column1})
df1

   Names
0  Rahul
1   Ajay
2  Kiran
3  Mohan

In [22]:
#Let's create second dataframe
column2 = [46,20,47,39]
df2 = pd.DataFrame({'Marks': column2})
df2

   Marks
0     46
1     20
2     47
3     39

### Note:
1.while concatenating two dataframes horizontally , both should have equal number of rows

2.while concatenating two dataframes vertically , both should have equal number of columns and make sure that same names for columns in both dataframes.

3.We use axis = 1 ,for concatenating horizontally(side by side) and axis = 0 for vertically.

### Now let's concatenate two dataframes side by side

In [25]:
df3 = pd.concat([df1,df2],axis=1,ignore_index = True) #ignore_index = True will delete column names
df3

       0   1
0  Rahul  46
1   Ajay  20
2  Kiran  47
3  Mohan  39

In [26]:
df3 = pd.concat([df1,df2],axis=1)
df3

   Names  Marks
0  Rahul     46
1   Ajay     20
2  Kiran     47
3  Mohan     39

# Pandas Date Range

In [27]:
#importing pandas library
import pandas as pd

### Note:
1.Pandas date range are super useful for creating range of times or dates.

2.It is mainly udes to reindexing our Datetime index.

### Creating simple Daterange 
### Format:
 pd.date_range(start_time,end_time)

#### Year-month-date

In [28]:
pd.date_range(start = '2021-01-01', end ='2021-01-06',freq ='D')

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [29]:
#here we created 6 dates as we have frequency ='Day'

#### Creating a Date range in 6 minutes interval   
Let's split date time in 6minutes interval

In [31]:
pd.date_range(start = '2021-01-01 00:00:00', end ='2021-01-01 00:24:00',freq ='6T')

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:06:00',
               '2021-01-01 00:12:00', '2021-01-01 00:18:00',
               '2021-01-01 00:24:00'],
              dtype='datetime64[ns]', freq='6T')

In [32]:
#Here we have mentioned the starting date and ending date as same day as we want minute intervals
#Also we have mentioned the [hours:minutes:seconds] and ending is 24 minutes.

### Creating Date range with 10 equal periods

In [33]:
pd.date_range(start = '2021-01-01 00:00:00', end ='2021-01-01 00:24:00',periods =10)

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:02:40',
               '2021-01-01 00:05:20', '2021-01-01 00:08:00',
               '2021-01-01 00:10:40', '2021-01-01 00:13:20',
               '2021-01-01 00:16:00', '2021-01-01 00:18:40',
               '2021-01-01 00:21:20', '2021-01-01 00:24:00'],
              dtype='datetime64[ns]', freq=None)

In [34]:
#Here we have equal time intervals between two adjacent date ranges and we have created 10 timestraps like this

### Let's get through different frequencies

### Business Day
1.Let's print all the working days present between 2 time intervals.

In [36]:
pd.date_range(start = '2020-01-01 ', end ='2020-01-10 ',freq = 'B')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-06',
               '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='B')

In [37]:
#From the above we can see that 2020-01-04 , 2020-01-05 are not printed because of weekends[holidays].

### Week Day

In [38]:
pd.date_range(start = '2020-01-01 ', end ='2020-03-10 ',freq = 'W')

DatetimeIndex(['2020-01-05', '2020-01-12', '2020-01-19', '2020-01-26',
               '2020-02-02', '2020-02-09', '2020-02-16', '2020-02-23',
               '2020-03-01', '2020-03-08'],
              dtype='datetime64[ns]', freq='W-SUN')

In [39]:
#Here it has cutted date ranges into weeks

### Months

In [40]:
pd.date_range(start = '2020-01-01 ', end ='2020-04-10 ',freq = 'M')

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31'], dtype='datetime64[ns]', freq='M')

In [41]:
#Here it has cutted date ranges into months

### Quarters

In [42]:
pd.date_range(start = '2020-01-01 ', end ='2020-12-01 ',freq = 'Q')

DatetimeIndex(['2020-03-31', '2020-06-30', '2020-09-30'], dtype='datetime64[ns]', freq='Q-DEC')